Repository: N0I0C0K/PowerTranslator
Catalog: cmdpal/PowerTranslatorExtension/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# Cmd_Translator_DisplayName
source: Translator
zh_cn: 翻译
zh_tw: 翻譯

# Cmd_Translator_Subtitle
source: Translate any text
zh_cn: 翻译任意文本
zh_tw: 翻譯任意文字

# Cmd_History_Title
source: Translation history
zh_cn: 翻译历史
zh_tw: 翻譯紀錄

# Cmd_History_Subtitle
source: Recent translations
zh_cn: 最近的翻译记录
zh_tw: 最近的翻譯紀錄

# Cmd_Languages_Title
source: Supported languages
zh_cn: 支持的语言
zh_tw: 支援的語言

# Cmd_Languages_Subtitle
source: Browse language codes
zh_cn: 查看可用语言代码
zh_tw: 瀏覽可用的語言代碼

# Page_Translator_Placeholder
source: Enter any text, optionally followed by `-> <lang>`
zh_cn: 输入要翻译的文本，可在末尾追加 `-> 语言码`
zh_tw: 輸入要翻譯的文字，可在結尾加上 `-> 語言代碼`

# Page_History_Placeholder
source: Recent translations
zh_cn: 最近的翻译记录
zh_tw: 最近的翻譯紀錄

# Page_Languages_Placeholder
source: Use short code as target language
zh_cn: 使用简短代码作为目标语言
zh_tw: 使用簡短代碼作為目標語言

# Empty_History_Title
source: History
zh_cn: 历史记录
zh_tw: 紀錄

# Empty_History_Subtitle
source: View recent translations
zh_cn: 查看最近的翻译记录
zh_tw: 檢視最近的翻譯紀錄

# Empty_Languages_Title
source: Supported languages
zh_cn: 支持的语言
zh_tw: 支援的語言

# Empty_Languages_Subtitle
source: Browse the language codes you can target with `-> <code>`
zh_cn: 浏览可作为目标语言的代码，配合 `-> 代码` 使用
zh_tw: 瀏覽可作為目標語言的代碼，搭配 `-> 代碼` 使用

# Empty_Help_Title
source: Find help
zh_cn: 寻求帮助
zh_tw: 尋求協助

# Empty_Help_Subtitle
source: Open the project's issue page
zh_cn: 打开项目 issue 页面
zh_tw: 開啟專案 issue 頁面

# Empty_NoHistory_Title
source: No history yet
zh_cn: 暂无历史记录
zh_tw: 尚無翻譯紀錄

# Empty_NoHistory_Subtitle
source: Recent translations will appear here
zh_cn: 最近的翻译将显示在这里
zh_tw: 最近的翻譯將顯示於此

# Status_Initializing_Title
source: initializing other apis...
zh_cn: 正在初始化其他翻译 API…
zh_tw: 正在初始化其他翻譯 API…

# Status_Initializing_Subtitle
source: please try later
zh_cn: 请稍后再试
zh_tw: 請稍候再試

# Status_TranslateError_Title
source: result is null, some error happen in translate. check out your network!
zh_cn: 翻译失败，请检查网络连接
zh_tw: 翻譯失敗，請檢查網路連線

# Status_TranslateError_Subtitle
source: Press enter to get help
zh_cn: 按回车键获取帮助
zh_tw: 按 Enter 取得協助

# Tag_SecondLanguage
source: [second language]
zh_cn: [第二目标语言]
zh_tw: [第二目標語言]

# Tag_QueryRaw
source: [query raw]
zh_cn: [原始查询]
zh_tw: [原始查詢]

# Tag_Exam
source: exam
zh_cn: 例句
zh_tw: 例句

# Tag_SmartResult
source: [smart result]
zh_cn: [智能结果]
zh_tw: [智慧結果]

# Verb_Open
source: Open
zh_cn: 打开
zh_tw: 開啟

# Context_CopySubtitle
source: Copy subtitle
zh_cn: 复制副标题
zh_tw: 複製副標題

# Context_ReadAloud
source: Read aloud
zh_cn: 朗读
zh_tw: 朗讀

# Context_JumpToDictionary
source: Jump to dictionary
zh_cn: 跳转到词典
zh_tw: 跳至辭典

# Setting_DefaultTargetLanguage_Label
source: Default target language
zh_cn: 默认目标语言
zh_tw: 預設目標語言

# Setting_DefaultTargetLanguage_Desc
source: Used when the query does not contain `->`
zh_cn: 在查询不包含 `->` 时使用
zh_tw: 在查詢未包含 `->` 時使用

# Setting_EnableSuggest_Label
source: Enable search suggestions
zh_cn: 启用搜索建议
zh_tw: 啟用搜尋建議

# Setting_EnableSuggest_Desc
source: Append Baidu autocomplete suggestions after translation results
zh_cn: 在翻译结果之后追加百度自动补全建议
zh_tw: 在翻譯結果之後附加百度自動完成建議

# Setting_EnableAutoRead_Label
source: Automatically read result
zh_cn: 自动朗读结果
zh_tw: 自動朗讀結果

# Setting_EnableAutoRead_Desc
source: Play TTS for the first result after each query
zh_cn: 每次查询后自动朗读第一条结果
zh_tw: 每次查詢後自動朗讀第一筆結果

# Setting_ShowOriginalQuery_Label
source: Show original query
zh_cn: 显示原始查询
zh_tw: 顯示原始查詢

# Setting_ShowOriginalQuery_Desc
source: Append the raw query as the final result row
zh_cn: 在结果末尾追加原始查询内容
zh_tw: 在結果末端附加原始查詢內容

# Setting_EnableJumpDictionary_Label
source: Show jump to dictionary command
zh_cn: 显示跳转到词典的命令
zh_tw: 顯示跳至辭典的指令

# Setting_EnableJumpDictionary_Desc
source: Adds a per-result command that opens the selected word in an online dictionary
zh_cn: 为每条结果添加在线词典查询命令
zh_tw: 為每筆結果加入線上辭典查詢指令

# Setting_DictionaryPattern_Label
source: Dictionary
zh_cn: 词典
zh_tw: 辭典

# Setting_DictionaryPattern_Desc
source: Which dictionary to jump to when the command above is enabled
zh_cn: 启用上述命令时使用哪个在线词典
zh_tw: 啟用上述指令時要使用哪個線上辭典

# Setting_EnableSecondLanguage_Label
source: Enable second target language
zh_cn: 启用第二目标语言
zh_tw: 啟用第二目標語言

# Setting_EnableSecondLanguage_Desc
source: Show an additional translation row for the language selected below
zh_cn: 为下方选择的语言额外显示一条翻译结果
zh_tw: 為下方選擇的語言額外顯示一筆翻譯結果

# Setting_SecondTargetLanguage_Label
source: Second target language
zh_cn: 第二目标语言
zh_tw: 第二目標語言

# Setting_SecondTargetLanguage_Desc
source: Only used when 'Enable second target language' is on
zh_cn: 仅在启用「启用第二目标语言」时生效
zh_tw: 僅在啟用「啟用第二目標語言」時生效

# Setting_UseSystemProxy_Label
source: Use system proxy
zh_cn: 使用系统代理
zh_tw: 使用系統 Proxy

# Setting_UseSystemProxy_Desc
source: Route HTTP requests through the Windows default proxy
zh_cn: 通过 Windows 默认代理转发 HTTP 请求
zh_tw: 透過 Windows 預設 Proxy 轉送 HTTP 請求

# Setting_EnableCodeMode_Label
source: Translate snake_case / camelCase words
zh_cn: 翻译 snake_case / camelCase 单词
zh_tw: 翻譯 snake_case / camelCase 單字

# Setting_EnableCodeMode_Desc
source: Split snake/camel words into spaces before translating
zh_cn: 翻译前将 snake/camel 单词按空格拆分
zh_tw: 翻譯前將 snake/camel 單字依空格拆分

# Language_auto
source: Auto
zh_cn: 自动
zh_tw: 自動

# Language_zhs
source: Chinese (Simplified)
zh_cn: 简体中文
zh_tw: 簡體中文

# Language_zht
source: Chinese (Traditional)
zh_cn: 繁体中文
zh_tw: 繁體中文

# Language_en
source: English
zh_cn: 英语
zh_tw: 英文

# Language_ja
source: Japanese
zh_cn: 日语
zh_tw: 日文

# Language_ko
source: Korean
zh_cn: 韩语
zh_tw: 韓文

# Language_ru
source: Russian
zh_cn: 俄语
zh_tw: 俄文

# Language_fr
source: French
zh_cn: 法语
zh_tw: 法文

# Language_es
source: Spanish
zh_cn: 西班牙语
zh_tw: 西班牙文

# Language_ar
source: Arabic
zh_cn: 阿拉伯语
zh_tw: 阿拉伯文

# Language_de
source: German
zh_cn: 德语
zh_tw: 德文

# Language_it
source: Italian
zh_cn: 意大利语
zh_tw: 義大利文

# Language_he
source: Hebrew
zh_cn: 希伯来语
zh_tw: 希伯來文

# Dictionary_Youdao
source: Youdao
zh_cn: 有道
zh_tw: 有道

# Dictionary_Oxford
source: Oxford
zh_cn: 牛津
zh_tw: 牛津

# Dictionary_Cambridge
source: Cambridge
zh_cn: 剑桥
zh_tw: 劍橋
